7767517
261 306
Input                    in0                      0 1 in0
Pad                      Pad_0                    1 1 in0 1
Permute                  permute_131              1 1 1 2 0=4
Convolution              conv_0                   1 1 2 3 0=32 1=6 11=6 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=3456
Swish                    silu_81                  1 1 3 4
Pad                      Pad_5                    1 1 4 5
Convolution              conv_1                   1 1 5 6 0=64 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=18432
Swish                    silu_82                  1 1 6 7
Split                    splitncnn_0              1 2 7 8 9
Convolution              conv_2                   1 1 9 10 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_83                  1 1 10 11
Split                    splitncnn_1              1 2 11 12 13
Convolution              conv_3                   1 1 8 14 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_84                  1 1 14 15
Convolution              conv_4                   1 1 13 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_85                  1 1 16 17
Convolution              conv_5                   1 1 17 18 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_2              1 2 18 19 20
Sigmoid                  sigmoid_65               1 1 20 21
BinaryOp                 mul_0                    2 1 19 21 22 0=2
BinaryOp                 add_1                    2 1 12 22 23 0=0
Concat                   cat_0                    2 1 23 15 24 0=0
Convolution              conv_6                   1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_86                  1 1 25 26
Pad                      Pad_26                   1 1 26 27
Convolution              conv_7                   1 1 27 28 0=128 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=73728
Swish                    silu_87                  1 1 28 29
Split                    splitncnn_3              1 2 29 30 31
Convolution              conv_8                   1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_88                  1 1 32 33
Split                    splitncnn_4              1 2 33 34 35
Convolution              conv_9                   1 1 35 36 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_89                  1 1 36 37
Convolution              conv_10                  1 1 37 38 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_5              1 2 38 39 40
Sigmoid                  sigmoid_66               1 1 40 41
BinaryOp                 mul_2                    2 1 39 41 42 0=2
BinaryOp                 add_3                    2 1 34 42 43 0=0
Split                    splitncnn_6              1 2 43 44 45
Convolution              conv_11                  1 1 45 46 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_90                  1 1 46 47
Convolution              conv_12                  1 1 47 48 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_7              1 2 48 49 50
Sigmoid                  sigmoid_67               1 1 50 51
BinaryOp                 mul_4                    2 1 49 51 52 0=2
BinaryOp                 add_5                    2 1 44 52 53 0=0
Convolution              conv_13                  1 1 30 54 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_91                  1 1 54 55
Concat                   cat_1                    2 1 53 55 56 0=0
Convolution              conv_14                  1 1 56 57 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_92                  1 1 57 58
Split                    splitncnn_8              1 2 58 59 60
Pad                      Pad_54                   1 1 59 61
Convolution              conv_15                  1 1 61 62 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=294912
Swish                    silu_93                  1 1 62 63
Split                    splitncnn_9              1 2 63 64 65
Convolution              conv_16                  1 1 65 66 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_94                  1 1 66 67
Convolution              conv_17                  1 1 64 68 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_95                  1 1 68 69
Split                    splitncnn_10             1 2 69 70 71
Convolution              conv_18                  1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_96                  1 1 72 73
Convolution              conv_19                  1 1 73 74 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_11             1 2 74 75 76
Sigmoid                  sigmoid_68               1 1 76 77
BinaryOp                 mul_6                    2 1 75 77 78 0=2
BinaryOp                 add_7                    2 1 70 78 79 0=0
Split                    splitncnn_12             1 2 79 80 81
Convolution              conv_20                  1 1 81 82 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_97                  1 1 82 83
Convolution              conv_21                  1 1 83 84 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 84 85 86
Sigmoid                  sigmoid_69               1 1 86 87
BinaryOp                 mul_8                    2 1 85 87 88 0=2
BinaryOp                 add_9                    2 1 80 88 89 0=0
Split                    splitncnn_14             1 2 89 90 91
Convolution              conv_22                  1 1 91 92 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_98                  1 1 92 93
Convolution              conv_23                  1 1 93 94 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_15             1 2 94 95 96
Sigmoid                  sigmoid_70               1 1 96 97
BinaryOp                 mul_10                   2 1 95 97 98 0=2
BinaryOp                 add_11                   2 1 90 98 99 0=0
Concat                   cat_2                    2 1 99 67 100 0=0
Convolution              conv_24                  1 1 100 101 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_99                  1 1 101 102
Split                    splitncnn_16             1 2 102 103 104
Pad                      Pad_89                   1 1 103 105
Convolution              conv_25                  1 1 105 106 0=512 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=1179648
Swish                    silu_100                 1 1 106 107
Split                    splitncnn_17             1 2 107 108 109
Convolution              conv_26                  1 1 109 110 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_101                 1 1 110 111
Convolution              conv_27                  1 1 108 112 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_102                 1 1 112 113
Split                    splitncnn_18             1 2 113 114 115
Convolution              conv_28                  1 1 115 116 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_103                 1 1 116 117
Convolution              conv_29                  1 1 117 118 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Split                    splitncnn_19             1 2 118 119 120
Sigmoid                  sigmoid_71               1 1 120 121
BinaryOp                 mul_12                   2 1 119 121 122 0=2
BinaryOp                 add_13                   2 1 114 122 123 0=0
Concat                   cat_3                    2 1 123 111 124 0=0
Convolution              conv_30                  1 1 124 125 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_104                 1 1 125 126
Convolution              conv_31                  1 1 126 127 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_105                 1 1 127 128
Split                    splitncnn_20             1 2 128 129 130
Pooling                  maxpool2d_62             1 1 130 131 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_21             1 2 131 132 133
Pooling                  maxpool2d_63             1 1 133 134 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_22             1 2 134 135 136
Pooling                  maxpool2d_64             1 1 136 137 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 129 132 135 137 138 0=0
Convolution              conv_32                  1 1 138 139 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_106                 1 1 139 140
Convolution              conv_33                  1 1 140 141 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_107                 1 1 141 142
Split                    splitncnn_23             1 2 142 143 144
Interp                   interpolate_60           1 1 144 145 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 145 104 146 0=0
Split                    splitncnn_24             1 2 146 147 148
Convolution              conv_34                  1 1 148 149 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_108                 1 1 149 150
Convolution              conv_35                  1 1 147 151 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_109                 1 1 151 152
Convolution              conv_36                  1 1 152 153 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_110                 1 1 153 154
Convolution              conv_37                  1 1 154 155 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_111                 1 1 155 156
Concat                   cat_6                    2 1 156 150 157 0=0
Convolution              conv_38                  1 1 157 158 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_112                 1 1 158 159
Convolution              conv_39                  1 1 159 160 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_113                 1 1 160 161
Split                    splitncnn_25             1 2 161 162 163
Interp                   interpolate_61           1 1 163 164 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 164 60 165 0=0
Split                    splitncnn_26             1 2 165 166 167
Convolution              conv_40                  1 1 167 168 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_114                 1 1 168 169
Convolution              conv_41                  1 1 166 170 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_115                 1 1 170 171
Convolution              conv_42                  1 1 171 172 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_116                 1 1 172 173
Convolution              conv_43                  1 1 173 174 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_117                 1 1 174 175
Concat                   cat_8                    2 1 175 169 176 0=0
Convolution              conv_44                  1 1 176 177 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_118                 1 1 177 178
Split                    splitncnn_27             1 2 178 179 180
Convolution              conv_45                  1 1 180 181 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
Permute                  permute_132              1 1 181 182 0=3
Reshape                  reshape_135              1 1 182 183 0=10 1=3 2=6400
Split                    splitncnn_28             1 3 183 184 185 186
Crop                     slice_0                  1 1 186 187 -23310=4,-233,-233,-233,10 -23311=4,0,0,1,2 -23309=4,0,0,0,4
Sigmoid                  sigmoid_72               1 1 187 188
Crop                     slice_1                  1 1 185 189 -23310=4,-233,-233,-233,4 -23311=4,0,0,1,2 -23309=4,0,0,0,2
Sigmoid                  sigmoid_73               1 1 189 190
Split                    splitncnn_29             1 2 190 191 192
MemoryData               const_fold_opt__627      0 1 193 0=2 1=3 2=1
MemoryData               const_fold_opt__581      0 1 194 0=2
Split                    splitncnn_0              1 6 194 195 196 197 198 199 200
BinaryOp                 mul_14                   2 1 191 192 201 0=2
BinaryOp                 mul_15                   2 1 201 193 202 0=2
Reshape                  reshape_136              1 1 195 203 0=2 1=1 2=1
BinaryOp                 mul_16                   2 1 202 203 204 0=2
Crop                     slice_2                  1 1 184 205 -23310=4,-233,-233,-233,2 -23311=4,0,0,1,2 -23309=4,0,0,0,0
Sigmoid                  sigmoid_74               1 1 205 206
MemoryData               const_fold_opt__620      0 1 207 0=2 1=1 2=6400
BinaryOp                 mul_17                   1 1 206 208 0=2 1=1 2=2.0
BinaryOp                 add_18                   2 1 208 207 209 0=0
BinaryOp                 mul_19                   1 1 209 210 0=2 1=1 2=8.0
Reshape                  reshape_137              1 1 200 211 0=2 1=1 2=1
BinaryOp                 mul_20                   2 1 210 211 212 0=2
Concat                   cat_9                    3 1 212 204 188 213 0=2
Reshape                  reshape_138              1 1 213 214 0=10 1=19200
Pad                      Pad_180                  1 1 179 215
Convolution              conv_46                  1 1 215 216 0=128 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=147456
Swish                    silu_119                 1 1 216 217
Concat                   cat_10                   2 1 217 162 218 0=0
Split                    splitncnn_30             1 2 218 219 220
Convolution              conv_47                  1 1 220 221 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_120                 1 1 221 222
Convolution              conv_48                  1 1 219 223 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_121                 1 1 223 224
Convolution              conv_49                  1 1 224 225 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_122                 1 1 225 226
Convolution              conv_50                  1 1 226 227 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_123                 1 1 227 228
Concat                   cat_11                   2 1 228 222 229 0=0
Convolution              conv_51                  1 1 229 230 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_124                 1 1 230 231
Split                    splitncnn_31             1 2 231 232 233
Convolution              conv_52                  1 1 233 234 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Permute                  permute_133              1 1 234 235 0=3
Reshape                  reshape_139              1 1 235 236 0=10 1=3 2=1600
Split                    splitncnn_32             1 3 236 237 238 239
Crop                     slice_3                  1 1 239 240 -23310=4,-233,-233,-233,10 -23311=4,0,0,1,2 -23309=4,0,0,0,4
Sigmoid                  sigmoid_75               1 1 240 241
Crop                     slice_4                  1 1 238 242 -23310=4,-233,-233,-233,4 -23311=4,0,0,1,2 -23309=4,0,0,0,2
Sigmoid                  sigmoid_76               1 1 242 243
Split                    splitncnn_33             1 2 243 244 245
MemoryData               const_fold_opt__624      0 1 246 0=2 1=3 2=1
BinaryOp                 mul_21                   2 1 244 245 247 0=2
BinaryOp                 mul_22                   2 1 247 246 248 0=2
Reshape                  reshape_140              1 1 199 249 0=2 1=1 2=1
BinaryOp                 mul_23                   2 1 248 249 250 0=2
Crop                     slice_5                  1 1 237 251 -23310=4,-233,-233,-233,2 -23311=4,0,0,1,2 -23309=4,0,0,0,0
Sigmoid                  sigmoid_77               1 1 251 252
MemoryData               const_fold_opt__619      0 1 253 0=2 1=1 2=1600
BinaryOp                 mul_24                   1 1 252 254 0=2 1=1 2=2.0
BinaryOp                 add_25                   2 1 254 253 255 0=0
BinaryOp                 mul_26                   1 1 255 256 0=2 1=1 2=16.0
Reshape                  reshape_141              1 1 198 257 0=2 1=1 2=1
BinaryOp                 mul_27                   2 1 256 257 258 0=2
Concat                   cat_12                   3 1 258 250 241 259 0=2
Reshape                  reshape_142              1 1 259 260 0=10 1=4800
Pad                      Pad_219                  1 1 232 261
Convolution              conv_53                  1 1 261 262 0=256 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=589824
Swish                    silu_125                 1 1 262 263
Concat                   cat_13                   2 1 263 143 264 0=0
Split                    splitncnn_34             1 2 264 265 266
Convolution              conv_54                  1 1 266 267 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_126                 1 1 267 268
Convolution              conv_55                  1 1 265 269 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_127                 1 1 269 270
Convolution              conv_56                  1 1 270 271 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_128                 1 1 271 272
Convolution              conv_57                  1 1 272 273 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_129                 1 1 273 274
Concat                   cat_14                   2 1 274 268 275 0=0
Convolution              conv_58                  1 1 275 276 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_130                 1 1 276 277
Convolution              conv_59                  1 1 277 278 0=30 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
Permute                  permute_134              1 1 278 279 0=3
Reshape                  reshape_143              1 1 279 280 0=10 1=3 2=400
Split                    splitncnn_35             1 3 280 281 282 283
Crop                     slice_6                  1 1 283 284 -23310=4,-233,-233,-233,10 -23311=4,0,0,1,2 -23309=4,0,0,0,4
Sigmoid                  sigmoid_78               1 1 284 285
Crop                     slice_7                  1 1 282 286 -23310=4,-233,-233,-233,4 -23311=4,0,0,1,2 -23309=4,0,0,0,2
Sigmoid                  sigmoid_79               1 1 286 287
Split                    splitncnn_36             1 2 287 288 289
MemoryData               const_fold_opt__626      0 1 290 0=2 1=3 2=1
BinaryOp                 mul_28                   2 1 288 289 291 0=2
BinaryOp                 mul_29                   2 1 291 290 292 0=2
Reshape                  reshape_144              1 1 197 293 0=2 1=1 2=1
BinaryOp                 mul_30                   2 1 292 293 294 0=2
Crop                     slice_8                  1 1 281 295 -23310=4,-233,-233,-233,2 -23311=4,0,0,1,2 -23309=4,0,0,0,0
Sigmoid                  sigmoid_80               1 1 295 296
MemoryData               const_fold_opt__618      0 1 297 0=2 1=1 2=400
BinaryOp                 mul_31                   1 1 296 298 0=2 1=1 2=2.0
BinaryOp                 add_32                   2 1 298 297 299 0=0
BinaryOp                 mul_33                   1 1 299 300 0=2 1=1 2=32.0
Reshape                  reshape_145              1 1 196 301 0=2 1=1 2=1
BinaryOp                 mul_34                   2 1 300 301 302 0=2
Concat                   cat_15                   3 1 302 294 285 303 0=2
Reshape                  reshape_146              1 1 303 304 0=10 1=1200
Concat                   cat_16                   3 1 214 260 304 out0 0=0
